cypress-etc/artillery/artillery.yml
config:
  target: 'https://search.api.hubmapconsortium.org'
  phases:
    - duration: 1
      arrivalRate: 1
  processor: "./helper.js"
scenarios:
  - flow:
    - post:
        url: "/portal/search"
        headers:
          'Content-Type': application/json
        body: "{{ $processEnvironment.HOME_PAGE_DATA_TYPES }}"
        afterResponse: "printStatus"
    - post:
        url: "/portal/search"
        headers:
          'Content-Type': application/json
        body: "{{ $processEnvironment.HOME_PAGE_ENTITY_TYPES }}"
        afterResponse: "printStatus"